"{\"class_name\": \"Tokenizer\", \"config\": {\"num_words\": 10000, \"filters\": \"!\\\"#$%&()*+,-./:;<=>?@[\\\\]^_`{|}~\\t\\n\", \"lower\": true, \"split\": \" \", \"char_level\": false, \"oov_token\": \"<OOV>\", \"document_count\": 251, \"word_counts\": \"{\\\"tell\\\": 57, \\\"bangalore\\\": 47, \\\"palace\\\": 12, \\\"located\\\": 57, \\\"timings\\\": 57, \\\"much\\\": 57, \\\"cost\\\": 57, \\\"kuntibetta\\\": 4, \\\"pyramid\\\": 4, \\\"valley\\\": 4, \\\"international\\\": 4, \\\"vidhana\\\": 4, \\\"soudha\\\": 4, \\\"iskcon\\\": 4, \\\"temple\\\": 4, \\\"akkayamma\\\": 4, \\\"betta\\\": 4, \\\"wonderla\\\": 4, \\\"amusement\\\": 4, \\\"park\\\": 16, \\\"nandi\\\": 4, \\\"hills\\\": 4, \\\"tipu\\\": 4, \\\"sultans\\\": 4, \\\"summer\\\": 4, \\\"hal\\\": 4, \\\"aerospace\\\": 4, \\\"museum\\\": 12, \\\"wonder\\\": 4, \\\"la\\\": 4, \\\"bannerghatta\\\": 4, \\\"national\\\": 4, \\\"visvesvaraya\\\": 4, \\\"industrial\\\": 4, \\\"technological\\\": 4, \\\"innovative\\\": 4, \\\"film\\\": 4, \\\"city\\\": 4, \\\"jawaharlal\\\": 4, \\\"nehru\\\": 4, \\\"planetarium\\\": 4, \\\"aquarium\\\": 4, \\\"thottikallu\\\": 4, \\\"falls\\\": 8, \\\"tg\\\": 4, \\\"halli\\\": 4, \\\"government\\\": 4, \\\"chunchi\\\": 4, \\\"leela\\\": 4, \\\"itc\\\": 4, \\\"windsor\\\": 4, \\\"taj\\\": 4, \\\"mg\\\": 4, \\\"road\\\": 4, \\\"conrad\\\": 4, \\\"bengaluru\\\": 20, \\\"jw\\\": 4, \\\"marriott\\\": 4, \\\"shangrila\\\": 4, \\\"hotel\\\": 24, \\\"ritzcarlton\\\": 4, \\\"four\\\": 8, \\\"seasons\\\": 8, \\\"hilton\\\": 4, \\\"oakwood\\\": 4, \\\"premier\\\": 4, \\\"radisson\\\": 4, \\\"blu\\\": 4, \\\"atria\\\": 4, \\\"sheraton\\\": 4, \\\"grand\\\": 4, \\\"chancery\\\": 4, \\\"pavilion\\\": 4, \\\"novotel\\\": 4, \\\"techpark\\\": 4, \\\"aloft\\\": 4, \\\"cessna\\\": 4, \\\"business\\\": 5, \\\"vivanta\\\": 4, \\\"whitefield\\\": 4, \\\"goldfinch\\\": 4, \\\"sterling\\\": 4, \\\"mac\\\": 4, \\\"brahmins\\\": 4, \\\"coffee\\\": 5, \\\"bar\\\": 4, \\\"central\\\": 4, \\\"tiffin\\\": 4, \\\"room\\\": 4, \\\"ctr\\\": 4, \\\"empire\\\": 4, \\\"mtr\\\": 4, \\\"truffles\\\": 4, \\\"place\\\": 4, \\\"skyye\\\": 4, \\\"rameshwaram\\\": 4, \\\"cafe\\\": 4, \\\"toit\\\": 4, \\\"brewpub\\\": 4, \\\"vidyarthi\\\": 4, \\\"bhavan\\\": 4, \\\"nagarjuna\\\": 4, \\\"burma\\\": 8, \\\"fatty\\\": 4, \\\"bao\\\": 4, \\\"karavalli\\\": 4, \\\"grasshopper\\\": 4, \\\"meghana\\\": 4, \\\"foods\\\": 4, \\\"oota\\\": 4, \\\"byg\\\": 4, \\\"brewski\\\": 4, \\\"brewing\\\": 4, \\\"company\\\": 4, \\\"best\\\": 3, \\\"places\\\": 3, \\\"recommend\\\": 3, \\\"hotels\\\": 12, \\\"restaurants\\\": 9, \\\"historical\\\": 1, \\\"site\\\": 1, \\\"swimming\\\": 1, \\\"pool\\\": 3, \\\"spa\\\": 1, \\\"multiple\\\": 1, \\\"fitness\\\": 1, \\\"center\\\": 2, \\\"fine\\\": 2, \\\"dining\\\": 2, \\\"rooftop\\\": 1, \\\"outdoor\\\": 1, \\\"restaurant\\\": 1, \\\"free\\\": 1, \\\"wifi\\\": 1, \\\"filter\\\": 1, \\\"vegetarian\\\": 1, \\\"south\\\": 1, \\\"indian\\\": 1, \\\"dosa\\\": 1, \\\"continental\\\": 1}\", \"word_docs\": \"{\\\"bangalore\\\": 47, \\\"tell\\\": 57, \\\"palace\\\": 12, \\\"located\\\": 57, \\\"timings\\\": 57, \\\"much\\\": 57, \\\"cost\\\": 57, \\\"kuntibetta\\\": 4, \\\"valley\\\": 4, \\\"international\\\": 4, \\\"pyramid\\\": 4, \\\"vidhana\\\": 4, \\\"soudha\\\": 4, \\\"iskcon\\\": 4, \\\"temple\\\": 4, \\\"betta\\\": 4, \\\"akkayamma\\\": 4, \\\"amusement\\\": 4, \\\"wonderla\\\": 4, \\\"park\\\": 16, \\\"nandi\\\": 4, \\\"hills\\\": 4, \\\"sultans\\\": 4, \\\"summer\\\": 4, \\\"tipu\\\": 4, \\\"hal\\\": 4, \\\"aerospace\\\": 4, \\\"museum\\\": 12, \\\"la\\\": 4, \\\"wonder\\\": 4, \\\"national\\\": 4, \\\"bannerghatta\\\": 4, \\\"visvesvaraya\\\": 4, \\\"technological\\\": 4, \\\"industrial\\\": 4, \\\"film\\\": 4, \\\"city\\\": 4, \\\"innovative\\\": 4, \\\"jawaharlal\\\": 4, \\\"planetarium\\\": 4, \\\"nehru\\\": 4, \\\"aquarium\\\": 4, \\\"thottikallu\\\": 4, \\\"tg\\\": 4, \\\"halli\\\": 4, \\\"falls\\\": 8, \\\"government\\\": 4, \\\"chunchi\\\": 4, \\\"leela\\\": 4, \\\"itc\\\": 4, \\\"windsor\\\": 4, \\\"mg\\\": 4, \\\"road\\\": 4, \\\"taj\\\": 4, \\\"bengaluru\\\": 20, \\\"conrad\\\": 4, \\\"marriott\\\": 4, \\\"jw\\\": 4, \\\"hotel\\\": 24, \\\"shangrila\\\": 4, \\\"ritzcarlton\\\": 4, \\\"seasons\\\": 8, \\\"four\\\": 8, \\\"hilton\\\": 4, \\\"premier\\\": 4, \\\"oakwood\\\": 4, \\\"atria\\\": 4, \\\"radisson\\\": 4, \\\"blu\\\": 4, \\\"sheraton\\\": 4, \\\"grand\\\": 4, \\\"pavilion\\\": 4, \\\"chancery\\\": 4, \\\"techpark\\\": 4, \\\"novotel\\\": 4, \\\"aloft\\\": 4, \\\"cessna\\\": 4, \\\"business\\\": 5, \\\"vivanta\\\": 4, \\\"whitefield\\\": 4, \\\"goldfinch\\\": 4, \\\"mac\\\": 4, \\\"sterling\\\": 4, \\\"bar\\\": 4, \\\"brahmins\\\": 4, \\\"coffee\\\": 5, \\\"ctr\\\": 4, \\\"room\\\": 4, \\\"central\\\": 4, \\\"tiffin\\\": 4, \\\"empire\\\": 4, \\\"mtr\\\": 4, \\\"truffles\\\": 4, \\\"place\\\": 4, \\\"skyye\\\": 4, \\\"rameshwaram\\\": 4, \\\"cafe\\\": 4, \\\"toit\\\": 4, \\\"brewpub\\\": 4, \\\"bhavan\\\": 4, \\\"vidyarthi\\\": 4, \\\"nagarjuna\\\": 4, \\\"burma\\\": 4, \\\"bao\\\": 4, \\\"fatty\\\": 4, \\\"karavalli\\\": 4, \\\"grasshopper\\\": 4, \\\"meghana\\\": 4, \\\"foods\\\": 4, \\\"oota\\\": 4, \\\"byg\\\": 4, \\\"brewski\\\": 4, \\\"brewing\\\": 4, \\\"company\\\": 4, \\\"places\\\": 3, \\\"best\\\": 3, \\\"recommend\\\": 3, \\\"hotels\\\": 12, \\\"restaurants\\\": 9, \\\"site\\\": 1, \\\"historical\\\": 1, \\\"pool\\\": 3, \\\"swimming\\\": 1, \\\"spa\\\": 1, \\\"multiple\\\": 1, \\\"fitness\\\": 1, \\\"center\\\": 2, \\\"dining\\\": 2, \\\"fine\\\": 2, \\\"rooftop\\\": 1, \\\"outdoor\\\": 1, \\\"restaurant\\\": 1, \\\"wifi\\\": 1, \\\"free\\\": 1, \\\"filter\\\": 1, \\\"vegetarian\\\": 1, \\\"south\\\": 1, \\\"indian\\\": 1, \\\"dosa\\\": 1, \\\"continental\\\": 1}\", \"index_docs\": \"{\\\"7\\\": 47, \\\"2\\\": 57, \\\"11\\\": 12, \\\"3\\\": 57, \\\"4\\\": 57, \\\"5\\\": 57, \\\"6\\\": 57, \\\"21\\\": 4, \\\"23\\\": 4, \\\"24\\\": 4, \\\"22\\\": 4, \\\"25\\\": 4, \\\"26\\\": 4, \\\"27\\\": 4, \\\"28\\\": 4, \\\"30\\\": 4, \\\"29\\\": 4, \\\"32\\\": 4, \\\"31\\\": 4, \\\"10\\\": 16, \\\"33\\\": 4, \\\"34\\\": 4, \\\"36\\\": 4, \\\"37\\\": 4, \\\"35\\\": 4, \\\"38\\\": 4, \\\"39\\\": 4, \\\"12\\\": 12, \\\"41\\\": 4, \\\"40\\\": 4, \\\"43\\\": 4, \\\"42\\\": 4, \\\"44\\\": 4, \\\"46\\\": 4, \\\"45\\\": 4, \\\"48\\\": 4, \\\"49\\\": 4, \\\"47\\\": 4, \\\"50\\\": 4, \\\"52\\\": 4, \\\"51\\\": 4, \\\"53\\\": 4, \\\"54\\\": 4, \\\"55\\\": 4, \\\"56\\\": 4, \\\"15\\\": 8, \\\"57\\\": 4, \\\"58\\\": 4, \\\"59\\\": 4, \\\"60\\\": 4, \\\"61\\\": 4, \\\"63\\\": 4, \\\"64\\\": 4, \\\"62\\\": 4, \\\"9\\\": 20, \\\"65\\\": 4, \\\"67\\\": 4, \\\"66\\\": 4, \\\"8\\\": 24, \\\"68\\\": 4, \\\"69\\\": 4, \\\"17\\\": 8, \\\"16\\\": 8, \\\"70\\\": 4, \\\"72\\\": 4, \\\"71\\\": 4, \\\"75\\\": 4, \\\"73\\\": 4, \\\"74\\\": 4, \\\"76\\\": 4, \\\"77\\\": 4, \\\"79\\\": 4, \\\"78\\\": 4, \\\"81\\\": 4, \\\"80\\\": 4, \\\"82\\\": 4, \\\"83\\\": 4, \\\"19\\\": 5, \\\"84\\\": 4, \\\"85\\\": 4, \\\"86\\\": 4, \\\"88\\\": 4, \\\"87\\\": 4, \\\"90\\\": 4, \\\"89\\\": 4, \\\"20\\\": 5, \\\"94\\\": 4, \\\"93\\\": 4, \\\"91\\\": 4, \\\"92\\\": 4, \\\"95\\\": 4, \\\"96\\\": 4, \\\"97\\\": 4, \\\"98\\\": 4, \\\"99\\\": 4, \\\"100\\\": 4, \\\"101\\\": 4, \\\"102\\\": 4, \\\"103\\\": 4, \\\"105\\\": 4, \\\"104\\\": 4, \\\"106\\\": 4, \\\"18\\\": 4, \\\"108\\\": 4, \\\"107\\\": 4, \\\"109\\\": 4, \\\"110\\\": 4, \\\"111\\\": 4, \\\"112\\\": 4, \\\"113\\\": 4, \\\"114\\\": 4, \\\"115\\\": 4, \\\"116\\\": 4, \\\"117\\\": 4, \\\"119\\\": 3, \\\"118\\\": 3, \\\"120\\\": 3, \\\"13\\\": 12, \\\"14\\\": 9, \\\"126\\\": 1, \\\"125\\\": 1, \\\"121\\\": 3, \\\"127\\\": 1, \\\"128\\\": 1, \\\"129\\\": 1, \\\"130\\\": 1, \\\"122\\\": 2, \\\"124\\\": 2, \\\"123\\\": 2, \\\"131\\\": 1, \\\"132\\\": 1, \\\"133\\\": 1, \\\"135\\\": 1, \\\"134\\\": 1, \\\"136\\\": 1, \\\"137\\\": 1, \\\"138\\\": 1, \\\"139\\\": 1, \\\"140\\\": 1, \\\"141\\\": 1}\", \"index_word\": \"{\\\"1\\\": \\\"<OOV>\\\", \\\"2\\\": \\\"tell\\\", \\\"3\\\": \\\"located\\\", \\\"4\\\": \\\"timings\\\", \\\"5\\\": \\\"much\\\", \\\"6\\\": \\\"cost\\\", \\\"7\\\": \\\"bangalore\\\", \\\"8\\\": \\\"hotel\\\", \\\"9\\\": \\\"bengaluru\\\", \\\"10\\\": \\\"park\\\", \\\"11\\\": \\\"palace\\\", \\\"12\\\": \\\"museum\\\", \\\"13\\\": \\\"hotels\\\", \\\"14\\\": \\\"restaurants\\\", \\\"15\\\": \\\"falls\\\", \\\"16\\\": \\\"four\\\", \\\"17\\\": \\\"seasons\\\", \\\"18\\\": \\\"burma\\\", \\\"19\\\": \\\"business\\\", \\\"20\\\": \\\"coffee\\\", \\\"21\\\": \\\"kuntibetta\\\", \\\"22\\\": \\\"pyramid\\\", \\\"23\\\": \\\"valley\\\", \\\"24\\\": \\\"international\\\", \\\"25\\\": \\\"vidhana\\\", \\\"26\\\": \\\"soudha\\\", \\\"27\\\": \\\"iskcon\\\", \\\"28\\\": \\\"temple\\\", \\\"29\\\": \\\"akkayamma\\\", \\\"30\\\": \\\"betta\\\", \\\"31\\\": \\\"wonderla\\\", \\\"32\\\": \\\"amusement\\\", \\\"33\\\": \\\"nandi\\\", \\\"34\\\": \\\"hills\\\", \\\"35\\\": \\\"tipu\\\", \\\"36\\\": \\\"sultans\\\", \\\"37\\\": \\\"summer\\\", \\\"38\\\": \\\"hal\\\", \\\"39\\\": \\\"aerospace\\\", \\\"40\\\": \\\"wonder\\\", \\\"41\\\": \\\"la\\\", \\\"42\\\": \\\"bannerghatta\\\", \\\"43\\\": \\\"national\\\", \\\"44\\\": \\\"visvesvaraya\\\", \\\"45\\\": \\\"industrial\\\", \\\"46\\\": \\\"technological\\\", \\\"47\\\": \\\"innovative\\\", \\\"48\\\": \\\"film\\\", \\\"49\\\": \\\"city\\\", \\\"50\\\": \\\"jawaharlal\\\", \\\"51\\\": \\\"nehru\\\", \\\"52\\\": \\\"planetarium\\\", \\\"53\\\": \\\"aquarium\\\", \\\"54\\\": \\\"thottikallu\\\", \\\"55\\\": \\\"tg\\\", \\\"56\\\": \\\"halli\\\", \\\"57\\\": \\\"government\\\", \\\"58\\\": \\\"chunchi\\\", \\\"59\\\": \\\"leela\\\", \\\"60\\\": \\\"itc\\\", \\\"61\\\": \\\"windsor\\\", \\\"62\\\": \\\"taj\\\", \\\"63\\\": \\\"mg\\\", \\\"64\\\": \\\"road\\\", \\\"65\\\": \\\"conrad\\\", \\\"66\\\": \\\"jw\\\", \\\"67\\\": \\\"marriott\\\", \\\"68\\\": \\\"shangrila\\\", \\\"69\\\": \\\"ritzcarlton\\\", \\\"70\\\": \\\"hilton\\\", \\\"71\\\": \\\"oakwood\\\", \\\"72\\\": \\\"premier\\\", \\\"73\\\": \\\"radisson\\\", \\\"74\\\": \\\"blu\\\", \\\"75\\\": \\\"atria\\\", \\\"76\\\": \\\"sheraton\\\", \\\"77\\\": \\\"grand\\\", \\\"78\\\": \\\"chancery\\\", \\\"79\\\": \\\"pavilion\\\", \\\"80\\\": \\\"novotel\\\", \\\"81\\\": \\\"techpark\\\", \\\"82\\\": \\\"aloft\\\", \\\"83\\\": \\\"cessna\\\", \\\"84\\\": \\\"vivanta\\\", \\\"85\\\": \\\"whitefield\\\", \\\"86\\\": \\\"goldfinch\\\", \\\"87\\\": \\\"sterling\\\", \\\"88\\\": \\\"mac\\\", \\\"89\\\": \\\"brahmins\\\", \\\"90\\\": \\\"bar\\\", \\\"91\\\": \\\"central\\\", \\\"92\\\": \\\"tiffin\\\", \\\"93\\\": \\\"room\\\", \\\"94\\\": \\\"ctr\\\", \\\"95\\\": \\\"empire\\\", \\\"96\\\": \\\"mtr\\\", \\\"97\\\": \\\"truffles\\\", \\\"98\\\": \\\"place\\\", \\\"99\\\": \\\"skyye\\\", \\\"100\\\": \\\"rameshwaram\\\", \\\"101\\\": \\\"cafe\\\", \\\"102\\\": \\\"toit\\\", \\\"103\\\": \\\"brewpub\\\", \\\"104\\\": \\\"vidyarthi\\\", \\\"105\\\": \\\"bhavan\\\", \\\"106\\\": \\\"nagarjuna\\\", \\\"107\\\": \\\"fatty\\\", \\\"108\\\": \\\"bao\\\", \\\"109\\\": \\\"karavalli\\\", \\\"110\\\": \\\"grasshopper\\\", \\\"111\\\": \\\"meghana\\\", \\\"112\\\": \\\"foods\\\", \\\"113\\\": \\\"oota\\\", \\\"114\\\": \\\"byg\\\", \\\"115\\\": \\\"brewski\\\", \\\"116\\\": \\\"brewing\\\", \\\"117\\\": \\\"company\\\", \\\"118\\\": \\\"best\\\", \\\"119\\\": \\\"places\\\", \\\"120\\\": \\\"recommend\\\", \\\"121\\\": \\\"pool\\\", \\\"122\\\": \\\"center\\\", \\\"123\\\": \\\"fine\\\", \\\"124\\\": \\\"dining\\\", \\\"125\\\": \\\"historical\\\", \\\"126\\\": \\\"site\\\", \\\"127\\\": \\\"swimming\\\", \\\"128\\\": \\\"spa\\\", \\\"129\\\": \\\"multiple\\\", \\\"130\\\": \\\"fitness\\\", \\\"131\\\": \\\"rooftop\\\", \\\"132\\\": \\\"outdoor\\\", \\\"133\\\": \\\"restaurant\\\", \\\"134\\\": \\\"free\\\", \\\"135\\\": \\\"wifi\\\", \\\"136\\\": \\\"filter\\\", \\\"137\\\": \\\"vegetarian\\\", \\\"138\\\": \\\"south\\\", \\\"139\\\": \\\"indian\\\", \\\"140\\\": \\\"dosa\\\", \\\"141\\\": \\\"continental\\\"}\", \"word_index\": \"{\\\"<OOV>\\\": 1, \\\"tell\\\": 2, \\\"located\\\": 3, \\\"timings\\\": 4, \\\"much\\\": 5, \\\"cost\\\": 6, \\\"bangalore\\\": 7, \\\"hotel\\\": 8, \\\"bengaluru\\\": 9, \\\"park\\\": 10, \\\"palace\\\": 11, \\\"museum\\\": 12, \\\"hotels\\\": 13, \\\"restaurants\\\": 14, \\\"falls\\\": 15, \\\"four\\\": 16, \\\"seasons\\\": 17, \\\"burma\\\": 18, \\\"business\\\": 19, \\\"coffee\\\": 20, \\\"kuntibetta\\\": 21, \\\"pyramid\\\": 22, \\\"valley\\\": 23, \\\"international\\\": 24, \\\"vidhana\\\": 25, \\\"soudha\\\": 26, \\\"iskcon\\\": 27, \\\"temple\\\": 28, \\\"akkayamma\\\": 29, \\\"betta\\\": 30, \\\"wonderla\\\": 31, \\\"amusement\\\": 32, \\\"nandi\\\": 33, \\\"hills\\\": 34, \\\"tipu\\\": 35, \\\"sultans\\\": 36, \\\"summer\\\": 37, \\\"hal\\\": 38, \\\"aerospace\\\": 39, \\\"wonder\\\": 40, \\\"la\\\": 41, \\\"bannerghatta\\\": 42, \\\"national\\\": 43, \\\"visvesvaraya\\\": 44, \\\"industrial\\\": 45, \\\"technological\\\": 46, \\\"innovative\\\": 47, \\\"film\\\": 48, \\\"city\\\": 49, \\\"jawaharlal\\\": 50, \\\"nehru\\\": 51, \\\"planetarium\\\": 52, \\\"aquarium\\\": 53, \\\"thottikallu\\\": 54, \\\"tg\\\": 55, \\\"halli\\\": 56, \\\"government\\\": 57, \\\"chunchi\\\": 58, \\\"leela\\\": 59, \\\"itc\\\": 60, \\\"windsor\\\": 61, \\\"taj\\\": 62, \\\"mg\\\": 63, \\\"road\\\": 64, \\\"conrad\\\": 65, \\\"jw\\\": 66, \\\"marriott\\\": 67, \\\"shangrila\\\": 68, \\\"ritzcarlton\\\": 69, \\\"hilton\\\": 70, \\\"oakwood\\\": 71, \\\"premier\\\": 72, \\\"radisson\\\": 73, \\\"blu\\\": 74, \\\"atria\\\": 75, \\\"sheraton\\\": 76, \\\"grand\\\": 77, \\\"chancery\\\": 78, \\\"pavilion\\\": 79, \\\"novotel\\\": 80, \\\"techpark\\\": 81, \\\"aloft\\\": 82, \\\"cessna\\\": 83, \\\"vivanta\\\": 84, \\\"whitefield\\\": 85, \\\"goldfinch\\\": 86, \\\"sterling\\\": 87, \\\"mac\\\": 88, \\\"brahmins\\\": 89, \\\"bar\\\": 90, \\\"central\\\": 91, \\\"tiffin\\\": 92, \\\"room\\\": 93, \\\"ctr\\\": 94, \\\"empire\\\": 95, \\\"mtr\\\": 96, \\\"truffles\\\": 97, \\\"place\\\": 98, \\\"skyye\\\": 99, \\\"rameshwaram\\\": 100, \\\"cafe\\\": 101, \\\"toit\\\": 102, \\\"brewpub\\\": 103, \\\"vidyarthi\\\": 104, \\\"bhavan\\\": 105, \\\"nagarjuna\\\": 106, \\\"fatty\\\": 107, \\\"bao\\\": 108, \\\"karavalli\\\": 109, \\\"grasshopper\\\": 110, \\\"meghana\\\": 111, \\\"foods\\\": 112, \\\"oota\\\": 113, \\\"byg\\\": 114, \\\"brewski\\\": 115, \\\"brewing\\\": 116, \\\"company\\\": 117, \\\"best\\\": 118, \\\"places\\\": 119, \\\"recommend\\\": 120, \\\"pool\\\": 121, \\\"center\\\": 122, \\\"fine\\\": 123, \\\"dining\\\": 124, \\\"historical\\\": 125, \\\"site\\\": 126, \\\"swimming\\\": 127, \\\"spa\\\": 128, \\\"multiple\\\": 129, \\\"fitness\\\": 130, \\\"rooftop\\\": 131, \\\"outdoor\\\": 132, \\\"restaurant\\\": 133, \\\"free\\\": 134, \\\"wifi\\\": 135, \\\"filter\\\": 136, \\\"vegetarian\\\": 137, \\\"south\\\": 138, \\\"indian\\\": 139, \\\"dosa\\\": 140, \\\"continental\\\": 141}\"}}"